import AppHeader from "@/components/ui/dash-header/AppHeader";
import "./policy.css";

const PersonalPolicy = () => {
  return (
    <>
      <AppHeader />
      <div className="container">
        <h1>Политика обработки персональных данных</h1>

        <div className="section">
          <h2>1. Общие положения</h2>
          <ul>
            <li>
              1.1. Настоящая Политика обработки персональных данных (далее –
              Политика) разработана в соответствии с законодательством о защите
              персональных данных и регулирует порядок обработки и защиты
              персональных данных пользователей сайта Studai (далее – Сайт).
            </li>
            <li>
              1.2. Политика направлена на обеспечение защиты прав и свобод
              пользователей при обработке их персональных данных.
            </li>
          </ul>
        </div>

        <div className="section">
          <h2>2. Персональные данные пользователей</h2>
          <ul>
            <li>
              2.1. Персональные данные – любая информация, относящаяся к прямо
              или косвенно определенному или определяемому физическому лицу
              (субъекту персональных данных).
            </li>
            <li>
              2.2. К персональным данным пользователей, которые обрабатывает
              Сайт, относятся:
              <ul>
                <li>фамилия, имя, отчество;</li>
                <li>контактный телефон;</li>
                <li>адрес электронной почты;</li>
                <li>
                  информация об использовании сайта (cookie-файлы, IP-адрес и
                  др.).
                </li>
              </ul>
            </li>
          </ul>
        </div>

        <div className="section">
          <h2>3. Цели обработки персональных данных</h2>
          <ul>
            <li>
              3.1. Персональные данные пользователей обрабатываются для
              следующих целей:
              <ul>
                <li>регистрация пользователя на сайте;</li>
                <li>предоставление пользователю услуг сайта;</li>
                <li>улучшение качества обслуживания пользователей;</li>
                <li>
                  направление пользователю информационных сообщений, включая
                  рекламные и иные предложения сайта;
                </li>
                <li>выполнение требований законодательства.</li>
              </ul>
            </li>
          </ul>
        </div>

        <div className="section">
          <h2>4. Порядок и условия обработки персональных данных</h2>
          <ul>
            <li>
              4.1. Обработка персональных данных пользователей осуществляется с
              их согласия и в соответствии с законодательством о защите
              персональных данных.
            </li>
            <li>
              4.2. Персональные данные пользователей обрабатываются с
              использованием средств автоматизации или без использования таких
              средств.
            </li>
            <li>
              4.3. Сайт не передает персональные данные третьим лицам без
              согласия пользователей, за исключением случаев, предусмотренных
              законодательством.
            </li>
            <li>
              4.4. Сайт принимает необходимые меры для защиты персональных
              данных пользователей от неправомерного или случайного доступа,
              уничтожения, изменения, блокирования, копирования,
              распространения, а также от иных неправомерных действий.
            </li>
          </ul>
        </div>

        <div className="section">
          <h2>5. Права пользователей</h2>
          <ul>
            <li>
              5.1. Пользователи имеют право:
              <ul>
                <li>на доступ к своим персональным данным;</li>
                <li>
                  на уточнение, блокирование или уничтожение своих персональных
                  данных в случае их неполноты, устарелости, недостоверности или
                  неправомерной обработки;
                </li>
                <li>на отзыв согласия на обработку персональных данных;</li>
                <li>
                  на защиту своих прав и законных интересов, включая возмещение
                  убытков и компенсацию морального вреда.
                </li>
              </ul>
            </li>
          </ul>
        </div>

        <div className="section">
          <h2>6. Ответственность сторон</h2>
          <ul>
            <li>
              6.1. Сайт несет ответственность за соблюдение требований
              законодательства о защите персональных данных.
            </li>
            <li>
              6.2. Пользователи несут ответственность за предоставление
              достоверных персональных данных и своевременное информирование о
              их изменении.
            </li>
          </ul>
        </div>

        <div className="section">
          <h2>7. Заключительные положения</h2>
          <ul>
            <li>
              7.1. Настоящая Политика вступает в силу с момента ее утверждения и
              действует в течение неопределенного срока.
            </li>
            <li>
              7.2. Сайт вправе вносить изменения в настоящую Политику. Изменения
              вступают в силу с момента их публикации на сайте.
            </li>
            <li>
              7.3. Все предложения или вопросы по настоящей Политике следует
              направлять по указанным на сайте контактам.
            </li>
          </ul>
        </div>
      </div>
    </>
  );
};

export default PersonalPolicy;
