import AppHeader from "@/components/ui/dash-header/AppHeader";
import { UploadOutlined } from "@ant-design/icons";
import { Button, Space } from "antd";
import "./agreement.css";
const Agreement = () => {
  return (
    <>
      <AppHeader />
      <div className="container">
        <h1>Пользовательское соглашение</h1>

        <div className="section">
          <h2>1. Общие положения</h2>
          <ul>
            <li>
              1.1. Настоящее Пользовательское соглашение (далее – Соглашение)
              регулирует отношения между владельцем сайта Studai (далее –
              Администрация) и физическим или юридическим лицом, использующим
              сайт Studai (далее – Пользователь).
            </li>
            <li>
              1.2. Сайт Studai предоставляет Пользователю услуги по генерации
              студенческих работ.
            </li>
            <li>
              1.3. Использование материалов и сервисов сайта регулируется
              нормами действующего законодательства.
            </li>
            <li>
              1.4. Пользователь обязан ознакомиться с условиями данного
              Соглашения до начала использования сайта. Использование сайта
              означает полное согласие с условиями данного Соглашения.
            </li>
          </ul>
        </div>

        <div className="section">
          <h2>2. Права и обязанности сторон</h2>
          <ul>
            <li>
              2.1. Пользователь имеет право:
              <ul>
                <li>использовать все доступные сервисы сайта;</li>
                <li>задавать любые вопросы, связанные с услугами сайта;</li>
                <li>
                  использовать сайт исключительно для личных нужд, не связанных
                  с коммерческой деятельностью.
                </li>
              </ul>
            </li>
            <li>
              2.2. Пользователь обязан:
              <ul>
                <li>
                  предоставлять достоверную информацию при регистрации на сайте;
                </li>
                <li>не нарушать работу сайта;</li>
                <li>соблюдать авторские и смежные права;</li>
                <li>
                  не размещать информацию, нарушающую законодательство или права
                  третьих лиц.
                </li>
              </ul>
            </li>
            <li>
              2.3. Администрация имеет право:
              <ul>
                <li>
                  изменять правила использования сайта, а также изменять
                  содержание данного сайта;
                </li>
                <li>
                  ограничивать доступ к сайту в случае нарушения Пользователем
                  условий настоящего Соглашения;
                </li>
                <li>
                  приостанавливать временно или полностью работу сайта в случае
                  технических неполадок или проведения профилактических работ.
                </li>
              </ul>
            </li>
            <li>
              2.4. Администрация обязана:
              <ul>
                <li>
                  обеспечивать доступ к сайту 24/7 за исключением случаев
                  проведения профилактических работ или возникновения
                  технических неполадок;
                </li>
                <li>
                  обрабатывать персональные данные Пользователя в соответствии с
                  Политикой конфиденциальности.
                </li>
              </ul>
            </li>
          </ul>
        </div>

        <div className="section">
          <h2>3. Ответственность сторон</h2>
          <ul>
            <li>
              3.1. Администрация не несет ответственности за достоверность
              информации, предоставляемой Пользователями.
            </li>
            <li>
              3.2. Администрация не несет ответственности за любой ущерб,
              понесенный Пользователем в результате использования сайта.
            </li>
            <li>
              3.3. Пользователь несет полную ответственность за соблюдение
              законодательства при использовании сайта.
            </li>
          </ul>
        </div>

        <div className="section">
          <h2>4. Порядок разрешения споров</h2>
          <ul>
            <li>
              4.1. В случае возникновения разногласий между Пользователем и
              Администрацией, стороны обязуются решить их путем переговоров.
            </li>
            <li>
              4.2. В случае невозможности решения спора путем переговоров, спор
              подлежит рассмотрению в суде по месту нахождения Администрации.
            </li>
          </ul>
        </div>

        <div className="section">
          <h2>5. Прочие условия</h2>
          <ul>
            <li>
              5.1. Настоящее Соглашение вступает в силу с момента его акцепта
              Пользователем и действует в течение неопределенного срока.
            </li>
            <li>
              5.2. Все предложения или вопросы по настоящему Соглашению следует
              направлять по указанным на сайте контактам.
            </li>
            <li>
              5.3. Настоящее Соглашение может быть изменено Администрацией в
              одностороннем порядке. Изменения вступают в силу с момента их
              публикации на сайте.
            </li>
          </ul>
        </div>
      </div>
    </>
  );
};

export default Agreement;
